alperbasarn/homio-round-hmi/esp-idf/sdkconfig.defaults.esp32c6
# ESP32-C6 Specific Configuration
# Target: Waveshare ESP32-C6-Touch-AMOLED-1.43 with SH8601-compatible QSPI AMOLED

CONFIG_IDF_TARGET="esp32c6"

# CPU frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# Flash settings
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# WiFi 6 support (ESP32-C6 feature)
CONFIG_SOC_WIFI_HE_SUPPORT=y

# Default WiFi credentials (used if NVS has none)
CONFIG_QNOB_WIFI_SSID="Pamuk"
CONFIG_QNOB_WIFI_PASSWORD="Pamuk1732"

# USB Serial/JTAG Console
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Single core - no core pinning
CONFIG_FREERTOS_UNICORE=y

# OTA (allow HTTP updates for local testing)
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y
CONFIG_OTA_ALLOW_HTTP=y

# TLS certificate bundle for MQTTs/HTTPS
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# LVGL pixel format for SH8601 QSPI path
CONFIG_LV_COLOR_16_SWAP=y

# Matter over WiFi (not Thread) for ESP32-C6
CONFIG_ENABLE_WIFI_STATION=y
CONFIG_OPENTHREAD_ENABLED=n
